export default {
  loading: 'загрузка',
  resumeLabel: 'резюме',
  portfolioLabel: 'портфолио',
  pages: {
    index: 'Я',
    who: 'Кто',
    what: 'Что',
    why: 'Почему',
    how: 'Как',
  },
  index: {
    h1: 'Леонид Шарков',
    h2: 'Магический frontend',
    button: 'Обратиться',
  },
  who: {
    slide1: {
      h1: 'Фрилансер',
      text: 'Я занимаюсь фрилансом на протяжении 3 лет, выполняю стандартные задачи во многих сферах, но специлизируюсь на frontend-разработке. Работаю по предоплате или поэтапной оплате, проекты предоставляю через <code>git</code>-репозиторий или разворачиваю на вашем сервере.',
    },
    slide2: {
      h1: 'Разработчик',
      text: 'На протяжении 7 лет занимаюсь разработкой программного обеспечения. Системное программирование на <code>Си</code> и <code>С++</code>. Базовые знания <code>Java</code>. Опыт создания и обслуживания баз данных на языке <code>T-SQL</code>. Написание <code>Python</code> утилит и графических интерфейсов. Большое увлечение <code>web</code>-разработкой.',
    },
  },
  what: {
    card1: {
      header: 'вёрстка',
      text: 'HTML5, CSS3 вёрстка шаблонов по макетам в Figma, Photoshop. Валидность, адаптивность, кроссбраузерность и оптимизированность вёрстки гарантирована. Использование BEM, first-mobile методологий. Современный, лёгкий и расширяемый JS-код.',
    },
    card2: {
      header: 'Разработка',
      text: 'Работа на NodeJS; разработка web-приложений на различных фреймворках: Vue, Nuxt, React; собрка проектов разными системами сборки: Webpack, Gulp, Rollup. Оптимизация скорости загрузки приложений: ленивая загрузка изображений, ленивое выполнение js-скриптов.',
    },
    card3: {
      header: 'SPA приложения',
      text: 'Разработка одностраничных приложений (SPA: single page applications), не требующих перезагрузки для перехода между страницами (роутами) c использованием фремйворков Vue.js, Nuxt.js.',
    },
    card4: {
      header: 'web-Дизайн',
      text: 'Дизайн web-страниц в Figma, Photoshop: текстовая логика, типографика, цветовые схемы, мудборды, прототипирование, макеты для различных разрешений экранов и платформ.',
    },
  },
  why: {
    card1: {
      header: 'магия',
      text: 'Неординарность решений, отсутствие невозможных вещей, изобретательские идеи и всеоблемющая математика — главная магия программиста.',
    },
    card2: {
      header: 'скорость',
      text: 'Отлаженные системы сборки для разных типов проектов, большой опыт использования популярных библиотек. Собственные многочисленные наработки.',
    },
    card3: {
      header: 'качество',
      text: 'Код по паттернам, разделенный на модули, комментарии, документация, масштабируемость проектов. Отсутствие костылей. Размещение проектов на Git.',
    },
    card4: {
      header: 'прогресс',
      text: 'Современные технологии, последние утверждённые стандарты. Поддержка старых браузеров, систем, всех популярных платформ. Постоянно обновляющиеся библиотеки. Использование опыта других разработчиков.',
    },
  },
  how: {
    contacts: {
      header: 'Контакты',
      text: 'На связи в будни с 12:00 до 23:00. <br> Почту могу не увидеть, лучше <br> писать в Telegram.',
    },
    form: {
      header: 'Написать',
      name: {
        placeholder: 'Имя',
      },
      article: {
        placeholder: 'Сообщение',
      },
      file: {
        label: 'Файл',
      },
      submit: {
        label: 'Отправить',
      },
    },
    messages: {
      emptyFields: 'Заполните все поля формы',
      successSubmit: 'Сообщение успешно доставлено',
      successFileSubmit: 'Файл успешно доставлен',
      errorSubmit: 'Сообщение не доставлено',
      errorFileSubmit: 'Не удалось доставить файл',
      fileSelected: 'Выбран файл',
    },
  },
  portfolio: {
    header: 'Портфолио',
  },
  resume: {
    header: 'Леонид Шарков',
    subheader: 'Frontend-разработчик',
    name: {
      header: 'Леонид Шарков',
      text: 'Россия, г. Челябинск • +7 (982) 301-0531 <br> <a href="mailto:vk.mail.twitter@gmail.com"></a>',
    },
    about: {
      header: 'О себе',
      text: 'Увлечённый, креативный и ответственный разработчик. Занимаюсь программированием на протяжении 6 лет, а конкретно web-разработкой 3 года. Реализованные масштабируемые кроссплатформенные приложения, мобильные приложения, лендинги от прототипирования и концепции до полного развёртывания. Страсть к нетривиальным задачам, решение которых вызывает “вау”-эффект. Большое количество исключительно положительных отзывов и характеристик.',
    },
    education: {
      header: 'Образование',
      fLabel: 'МГУ',
      fDate: 'Авг 2017 — Сен 2018',
      fText: 'Факультет вычислительной математики и кибернетики, прикладная математика и информатика',
      sLabel: 'ЮУрГУ',
      sDate: 'Окт 2018 - Настоящее',
      sText: 'Факультет математики, механики и компьютерных технологий, приладная математика',
    },
    job: {
      header: 'Опыт',
      fLabel: 'Фриланс',
      fDate: 'Авг 2017 - Настоящее',
      fText: 'Web-разработка, вёрстка, правки по сайтам, лендинги, javascript, SPA-приложения',
      sLabel: 'Kost-agency',
      sDate: 'Фев 2020 - Настоящее',
      sText: 'Внештатный frontend-разработчик',
    },
    skills: {
      header: 'Умения',
      basic: 'Базовый WEB',
      pro: 'Продвинутый WEB',
      programs: 'Прогарммы',
      other: 'Другие',
    },
    langs: {
      header: 'Языки',
      text: 'Русский <br> Английский <br> JavaScript <br> Родной <br> Продвинутый <br> Второй родной',
    },
  },
};
